RT-Thread/rt-thread/bsp/freescale/platform/devices/MKL36Z4/include/MKL36Z4.h
#define LCD_WF8B_BPFLCD39(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD39_SHIFT))&LCD_WF8B_BPFLCD39_MASK)
#define LCD_WF8B_BPFLCD55_MASK                   0x20u
#define LCD_WF8B_BPFLCD55_SHIFT                  5
#define LCD_WF8B_BPFLCD55_WIDTH                  1
#define LCD_WF8B_BPFLCD55(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD55_SHIFT))&LCD_WF8B_BPFLCD55_MASK)
#define LCD_WF8B_BPFLCD47_MASK                   0x20u
#define LCD_WF8B_BPFLCD47_SHIFT                  5
#define LCD_WF8B_BPFLCD47_WIDTH                  1
#define LCD_WF8B_BPFLCD47(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD47_SHIFT))&LCD_WF8B_BPFLCD47_MASK)
#define LCD_WF8B_BPFLCD63_MASK                   0x20u
#define LCD_WF8B_BPFLCD63_SHIFT                  5
#define LCD_WF8B_BPFLCD63_WIDTH                  1
#define LCD_WF8B_BPFLCD63(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD63_SHIFT))&LCD_WF8B_BPFLCD63_MASK)
#define LCD_WF8B_BPFLCD43_MASK                   0x20u
#define LCD_WF8B_BPFLCD43_SHIFT                  5
#define LCD_WF8B_BPFLCD43_WIDTH                  1
#define LCD_WF8B_BPFLCD43(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD43_SHIFT))&LCD_WF8B_BPFLCD43_MASK)
#define LCD_WF8B_BPFLCD5_MASK                    0x20u
#define LCD_WF8B_BPFLCD5_SHIFT                   5
#define LCD_WF8B_BPFLCD5_WIDTH                   1
#define LCD_WF8B_BPFLCD5(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD5_SHIFT))&LCD_WF8B_BPFLCD5_MASK)
#define LCD_WF8B_BPFLCD62_MASK                   0x20u
#define LCD_WF8B_BPFLCD62_SHIFT                  5
#define LCD_WF8B_BPFLCD62_WIDTH                  1
#define LCD_WF8B_BPFLCD62(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD62_SHIFT))&LCD_WF8B_BPFLCD62_MASK)
#define LCD_WF8B_BPFLCD14_MASK                   0x20u
#define LCD_WF8B_BPFLCD14_SHIFT                  5
#define LCD_WF8B_BPFLCD14_WIDTH                  1
#define LCD_WF8B_BPFLCD14(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD14_SHIFT))&LCD_WF8B_BPFLCD14_MASK)
#define LCD_WF8B_BPFLCD24_MASK                   0x20u
#define LCD_WF8B_BPFLCD24_SHIFT                  5
#define LCD_WF8B_BPFLCD24_WIDTH                  1
#define LCD_WF8B_BPFLCD24(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD24_SHIFT))&LCD_WF8B_BPFLCD24_MASK)
#define LCD_WF8B_BPFLCD54_MASK                   0x20u
#define LCD_WF8B_BPFLCD54_SHIFT                  5
#define LCD_WF8B_BPFLCD54_WIDTH                  1
#define LCD_WF8B_BPFLCD54(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD54_SHIFT))&LCD_WF8B_BPFLCD54_MASK)
#define LCD_WF8B_BPFLCD15_MASK                   0x20u
#define LCD_WF8B_BPFLCD15_SHIFT                  5
#define LCD_WF8B_BPFLCD15_WIDTH                  1
#define LCD_WF8B_BPFLCD15(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD15_SHIFT))&LCD_WF8B_BPFLCD15_MASK)
#define LCD_WF8B_BPFLCD32_MASK                   0x20u
#define LCD_WF8B_BPFLCD32_SHIFT                  5
#define LCD_WF8B_BPFLCD32_WIDTH                  1
#define LCD_WF8B_BPFLCD32(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD32_SHIFT))&LCD_WF8B_BPFLCD32_MASK)
#define LCD_WF8B_BPFLCD61_MASK                   0x20u
#define LCD_WF8B_BPFLCD61_SHIFT                  5
#define LCD_WF8B_BPFLCD61_WIDTH                  1
#define LCD_WF8B_BPFLCD61(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD61_SHIFT))&LCD_WF8B_BPFLCD61_MASK)
#define LCD_WF8B_BPFLCD25_MASK                   0x20u
#define LCD_WF8B_BPFLCD25_SHIFT                  5
#define LCD_WF8B_BPFLCD25_WIDTH                  1
#define LCD_WF8B_BPFLCD25(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD25_SHIFT))&LCD_WF8B_BPFLCD25_MASK)
#define LCD_WF8B_BPFLCD60_MASK                   0x20u
#define LCD_WF8B_BPFLCD60_SHIFT                  5
#define LCD_WF8B_BPFLCD60_WIDTH                  1
#define LCD_WF8B_BPFLCD60(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD60_SHIFT))&LCD_WF8B_BPFLCD60_MASK)
#define LCD_WF8B_BPFLCD41_MASK                   0x20u
#define LCD_WF8B_BPFLCD41_SHIFT                  5
#define LCD_WF8B_BPFLCD41_WIDTH                  1
#define LCD_WF8B_BPFLCD41(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD41_SHIFT))&LCD_WF8B_BPFLCD41_MASK)
#define LCD_WF8B_BPFLCD33_MASK                   0x20u
#define LCD_WF8B_BPFLCD33_SHIFT                  5
#define LCD_WF8B_BPFLCD33_WIDTH                  1
#define LCD_WF8B_BPFLCD33(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD33_SHIFT))&LCD_WF8B_BPFLCD33_MASK)
#define LCD_WF8B_BPFLCD53_MASK                   0x20u
#define LCD_WF8B_BPFLCD53_SHIFT                  5
#define LCD_WF8B_BPFLCD53_WIDTH                  1
#define LCD_WF8B_BPFLCD53(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD53_SHIFT))&LCD_WF8B_BPFLCD53_MASK)
#define LCD_WF8B_BPFLCD59_MASK                   0x20u
#define LCD_WF8B_BPFLCD59_SHIFT                  5
#define LCD_WF8B_BPFLCD59_WIDTH                  1
#define LCD_WF8B_BPFLCD59(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD59_SHIFT))&LCD_WF8B_BPFLCD59_MASK)
#define LCD_WF8B_BPFLCD0_MASK                    0x20u
#define LCD_WF8B_BPFLCD0_SHIFT                   5
#define LCD_WF8B_BPFLCD0_WIDTH                   1
#define LCD_WF8B_BPFLCD0(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD0_SHIFT))&LCD_WF8B_BPFLCD0_MASK)
#define LCD_WF8B_BPFLCD46_MASK                   0x20u
#define LCD_WF8B_BPFLCD46_SHIFT                  5
#define LCD_WF8B_BPFLCD46_WIDTH                  1
#define LCD_WF8B_BPFLCD46(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD46_SHIFT))&LCD_WF8B_BPFLCD46_MASK)
#define LCD_WF8B_BPFLCD58_MASK                   0x20u
#define LCD_WF8B_BPFLCD58_SHIFT                  5
#define LCD_WF8B_BPFLCD58_WIDTH                  1
#define LCD_WF8B_BPFLCD58(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD58_SHIFT))&LCD_WF8B_BPFLCD58_MASK)
#define LCD_WF8B_BPFLCD26_MASK                   0x20u
#define LCD_WF8B_BPFLCD26_SHIFT                  5
#define LCD_WF8B_BPFLCD26_WIDTH                  1
#define LCD_WF8B_BPFLCD26(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD26_SHIFT))&LCD_WF8B_BPFLCD26_MASK)
#define LCD_WF8B_BPFLCD36_MASK                   0x20u
#define LCD_WF8B_BPFLCD36_SHIFT                  5
#define LCD_WF8B_BPFLCD36_WIDTH                  1
#define LCD_WF8B_BPFLCD36(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD36_SHIFT))&LCD_WF8B_BPFLCD36_MASK)
#define LCD_WF8B_BPFLCD10_MASK                   0x20u
#define LCD_WF8B_BPFLCD10_SHIFT                  5
#define LCD_WF8B_BPFLCD10_WIDTH                  1
#define LCD_WF8B_BPFLCD10(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD10_SHIFT))&LCD_WF8B_BPFLCD10_MASK)
#define LCD_WF8B_BPFLCD52_MASK                   0x20u
#define LCD_WF8B_BPFLCD52_SHIFT                  5
#define LCD_WF8B_BPFLCD52_WIDTH                  1
#define LCD_WF8B_BPFLCD52(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD52_SHIFT))&LCD_WF8B_BPFLCD52_MASK)
#define LCD_WF8B_BPFLCD57_MASK                   0x20u
#define LCD_WF8B_BPFLCD57_SHIFT                  5
#define LCD_WF8B_BPFLCD57_WIDTH                  1
#define LCD_WF8B_BPFLCD57(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD57_SHIFT))&LCD_WF8B_BPFLCD57_MASK)
#define LCD_WF8B_BPFLCD27_MASK                   0x20u
#define LCD_WF8B_BPFLCD27_SHIFT                  5
#define LCD_WF8B_BPFLCD27_WIDTH                  1
#define LCD_WF8B_BPFLCD27(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD27_SHIFT))&LCD_WF8B_BPFLCD27_MASK)
#define LCD_WF8B_BPFLCD11_MASK                   0x20u
#define LCD_WF8B_BPFLCD11_SHIFT                  5
#define LCD_WF8B_BPFLCD11_WIDTH                  1
#define LCD_WF8B_BPFLCD11(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD11_SHIFT))&LCD_WF8B_BPFLCD11_MASK)
#define LCD_WF8B_BPFLCD56_MASK                   0x20u
#define LCD_WF8B_BPFLCD56_SHIFT                  5
#define LCD_WF8B_BPFLCD56_WIDTH                  1
#define LCD_WF8B_BPFLCD56(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD56_SHIFT))&LCD_WF8B_BPFLCD56_MASK)
#define LCD_WF8B_BPFLCD1_MASK                    0x20u
#define LCD_WF8B_BPFLCD1_SHIFT                   5
#define LCD_WF8B_BPFLCD1_WIDTH                   1
#define LCD_WF8B_BPFLCD1(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD1_SHIFT))&LCD_WF8B_BPFLCD1_MASK)
#define LCD_WF8B_BPFLCD8_MASK                    0x20u
#define LCD_WF8B_BPFLCD8_SHIFT                   5
#define LCD_WF8B_BPFLCD8_WIDTH                   1
#define LCD_WF8B_BPFLCD8(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD8_SHIFT))&LCD_WF8B_BPFLCD8_MASK)
#define LCD_WF8B_BPFLCD40_MASK                   0x20u
#define LCD_WF8B_BPFLCD40_SHIFT                  5
#define LCD_WF8B_BPFLCD40_WIDTH                  1
#define LCD_WF8B_BPFLCD40(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD40_SHIFT))&LCD_WF8B_BPFLCD40_MASK)
#define LCD_WF8B_BPFLCD51_MASK                   0x20u
#define LCD_WF8B_BPFLCD51_SHIFT                  5
#define LCD_WF8B_BPFLCD51_WIDTH                  1
#define LCD_WF8B_BPFLCD51(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD51_SHIFT))&LCD_WF8B_BPFLCD51_MASK)
#define LCD_WF8B_BPFLCD16_MASK                   0x20u
#define LCD_WF8B_BPFLCD16_SHIFT                  5
#define LCD_WF8B_BPFLCD16_WIDTH                  1
#define LCD_WF8B_BPFLCD16(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD16_SHIFT))&LCD_WF8B_BPFLCD16_MASK)
#define LCD_WF8B_BPFLCD45_MASK                   0x20u
#define LCD_WF8B_BPFLCD45_SHIFT                  5
#define LCD_WF8B_BPFLCD45_WIDTH                  1
#define LCD_WF8B_BPFLCD45(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD45_SHIFT))&LCD_WF8B_BPFLCD45_MASK)
#define LCD_WF8B_BPFLCD6_MASK                    0x20u
#define LCD_WF8B_BPFLCD6_SHIFT                   5
#define LCD_WF8B_BPFLCD6_WIDTH                   1
#define LCD_WF8B_BPFLCD6(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD6_SHIFT))&LCD_WF8B_BPFLCD6_MASK)
#define LCD_WF8B_BPFLCD17_MASK                   0x20u
#define LCD_WF8B_BPFLCD17_SHIFT                  5
#define LCD_WF8B_BPFLCD17_WIDTH                  1
#define LCD_WF8B_BPFLCD17(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD17_SHIFT))&LCD_WF8B_BPFLCD17_MASK)
#define LCD_WF8B_BPFLCD28_MASK                   0x20u
#define LCD_WF8B_BPFLCD28_SHIFT                  5
#define LCD_WF8B_BPFLCD28_WIDTH                  1
#define LCD_WF8B_BPFLCD28(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD28_SHIFT))&LCD_WF8B_BPFLCD28_MASK)
#define LCD_WF8B_BPFLCD42_MASK                   0x20u
#define LCD_WF8B_BPFLCD42_SHIFT                  5
#define LCD_WF8B_BPFLCD42_WIDTH                  1
#define LCD_WF8B_BPFLCD42(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD42_SHIFT))&LCD_WF8B_BPFLCD42_MASK)
#define LCD_WF8B_BPFLCD29_MASK                   0x20u
#define LCD_WF8B_BPFLCD29_SHIFT                  5
#define LCD_WF8B_BPFLCD29_WIDTH                  1
#define LCD_WF8B_BPFLCD29(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD29_SHIFT))&LCD_WF8B_BPFLCD29_MASK)
#define LCD_WF8B_BPFLCD50_MASK                   0x20u
#define LCD_WF8B_BPFLCD50_SHIFT                  5
#define LCD_WF8B_BPFLCD50_WIDTH                  1
#define LCD_WF8B_BPFLCD50(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD50_SHIFT))&LCD_WF8B_BPFLCD50_MASK)
#define LCD_WF8B_BPFLCD18_MASK                   0x20u
#define LCD_WF8B_BPFLCD18_SHIFT                  5
#define LCD_WF8B_BPFLCD18_WIDTH                  1
#define LCD_WF8B_BPFLCD18(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD18_SHIFT))&LCD_WF8B_BPFLCD18_MASK)
#define LCD_WF8B_BPFLCD34_MASK                   0x20u
#define LCD_WF8B_BPFLCD34_SHIFT                  5
#define LCD_WF8B_BPFLCD34_WIDTH                  1
#define LCD_WF8B_BPFLCD34(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD34_SHIFT))&LCD_WF8B_BPFLCD34_MASK)
#define LCD_WF8B_BPFLCD19_MASK                   0x20u
#define LCD_WF8B_BPFLCD19_SHIFT                  5
#define LCD_WF8B_BPFLCD19_WIDTH                  1
#define LCD_WF8B_BPFLCD19(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD19_SHIFT))&LCD_WF8B_BPFLCD19_MASK)
#define LCD_WF8B_BPFLCD2_MASK                    0x20u
#define LCD_WF8B_BPFLCD2_SHIFT                   5
#define LCD_WF8B_BPFLCD2_WIDTH                   1
#define LCD_WF8B_BPFLCD2(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD2_SHIFT))&LCD_WF8B_BPFLCD2_MASK)
#define LCD_WF8B_BPFLCD9_MASK                    0x20u
#define LCD_WF8B_BPFLCD9_SHIFT                   5
#define LCD_WF8B_BPFLCD9_WIDTH                   1
#define LCD_WF8B_BPFLCD9(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD9_SHIFT))&LCD_WF8B_BPFLCD9_MASK)
#define LCD_WF8B_BPFLCD3_MASK                    0x20u
#define LCD_WF8B_BPFLCD3_SHIFT                   5
#define LCD_WF8B_BPFLCD3_WIDTH                   1
#define LCD_WF8B_BPFLCD3(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD3_SHIFT))&LCD_WF8B_BPFLCD3_MASK)
#define LCD_WF8B_BPFLCD37_MASK                   0x20u
#define LCD_WF8B_BPFLCD37_SHIFT                  5
#define LCD_WF8B_BPFLCD37_WIDTH                  1
#define LCD_WF8B_BPFLCD37(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD37_SHIFT))&LCD_WF8B_BPFLCD37_MASK)
#define LCD_WF8B_BPFLCD49_MASK                   0x20u
#define LCD_WF8B_BPFLCD49_SHIFT                  5
#define LCD_WF8B_BPFLCD49_WIDTH                  1
#define LCD_WF8B_BPFLCD49(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD49_SHIFT))&LCD_WF8B_BPFLCD49_MASK)
#define LCD_WF8B_BPFLCD20_MASK                   0x20u
#define LCD_WF8B_BPFLCD20_SHIFT                  5
#define LCD_WF8B_BPFLCD20_WIDTH                  1
#define LCD_WF8B_BPFLCD20(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD20_SHIFT))&LCD_WF8B_BPFLCD20_MASK)
#define LCD_WF8B_BPFLCD44_MASK                   0x20u
#define LCD_WF8B_BPFLCD44_SHIFT                  5
#define LCD_WF8B_BPFLCD44_WIDTH                  1
#define LCD_WF8B_BPFLCD44(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD44_SHIFT))&LCD_WF8B_BPFLCD44_MASK)
#define LCD_WF8B_BPFLCD30_MASK                   0x20u
#define LCD_WF8B_BPFLCD30_SHIFT                  5
#define LCD_WF8B_BPFLCD30_WIDTH                  1
#define LCD_WF8B_BPFLCD30(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD30_SHIFT))&LCD_WF8B_BPFLCD30_MASK)
#define LCD_WF8B_BPFLCD21_MASK                   0x20u
#define LCD_WF8B_BPFLCD21_SHIFT                  5
#define LCD_WF8B_BPFLCD21_WIDTH                  1
#define LCD_WF8B_BPFLCD21(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD21_SHIFT))&LCD_WF8B_BPFLCD21_MASK)
#define LCD_WF8B_BPFLCD35_MASK                   0x20u
#define LCD_WF8B_BPFLCD35_SHIFT                  5
#define LCD_WF8B_BPFLCD35_WIDTH                  1
#define LCD_WF8B_BPFLCD35(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD35_SHIFT))&LCD_WF8B_BPFLCD35_MASK)
#define LCD_WF8B_BPFLCD4_MASK                    0x20u
#define LCD_WF8B_BPFLCD4_SHIFT                   5
#define LCD_WF8B_BPFLCD4_WIDTH                   1
#define LCD_WF8B_BPFLCD4(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD4_SHIFT))&LCD_WF8B_BPFLCD4_MASK)
#define LCD_WF8B_BPFLCD31_MASK                   0x20u
#define LCD_WF8B_BPFLCD31_SHIFT                  5
#define LCD_WF8B_BPFLCD31_WIDTH                  1
#define LCD_WF8B_BPFLCD31(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD31_SHIFT))&LCD_WF8B_BPFLCD31_MASK)
#define LCD_WF8B_BPFLCD48_MASK                   0x20u
#define LCD_WF8B_BPFLCD48_SHIFT                  5
#define LCD_WF8B_BPFLCD48_WIDTH                  1
#define LCD_WF8B_BPFLCD48(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD48_SHIFT))&LCD_WF8B_BPFLCD48_MASK)
#define LCD_WF8B_BPFLCD7_MASK                    0x20u
#define LCD_WF8B_BPFLCD7_SHIFT                   5
#define LCD_WF8B_BPFLCD7_WIDTH                   1
#define LCD_WF8B_BPFLCD7(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD7_SHIFT))&LCD_WF8B_BPFLCD7_MASK)
#define LCD_WF8B_BPFLCD22_MASK                   0x20u
#define LCD_WF8B_BPFLCD22_SHIFT                  5
#define LCD_WF8B_BPFLCD22_WIDTH                  1
#define LCD_WF8B_BPFLCD22(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD22_SHIFT))&LCD_WF8B_BPFLCD22_MASK)
#define LCD_WF8B_BPFLCD38_MASK                   0x20u
#define LCD_WF8B_BPFLCD38_SHIFT                  5
#define LCD_WF8B_BPFLCD38_WIDTH                  1
#define LCD_WF8B_BPFLCD38(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD38_SHIFT))&LCD_WF8B_BPFLCD38_MASK)
#define LCD_WF8B_BPFLCD12_MASK                   0x20u
#define LCD_WF8B_BPFLCD12_SHIFT                  5
#define LCD_WF8B_BPFLCD12_WIDTH                  1
#define LCD_WF8B_BPFLCD12(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD12_SHIFT))&LCD_WF8B_BPFLCD12_MASK)
#define LCD_WF8B_BPFLCD23_MASK                   0x20u
#define LCD_WF8B_BPFLCD23_SHIFT                  5
#define LCD_WF8B_BPFLCD23_WIDTH                  1
#define LCD_WF8B_BPFLCD23(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPFLCD23_SHIFT))&LCD_WF8B_BPFLCD23_MASK)
#define LCD_WF8B_BPGLCD14_MASK                   0x40u
#define LCD_WF8B_BPGLCD14_SHIFT                  6
#define LCD_WF8B_BPGLCD14_WIDTH                  1
#define LCD_WF8B_BPGLCD14(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD14_SHIFT))&LCD_WF8B_BPGLCD14_MASK)
#define LCD_WF8B_BPGLCD55_MASK                   0x40u
#define LCD_WF8B_BPGLCD55_SHIFT                  6
#define LCD_WF8B_BPGLCD55_WIDTH                  1
#define LCD_WF8B_BPGLCD55(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD55_SHIFT))&LCD_WF8B_BPGLCD55_MASK)
#define LCD_WF8B_BPGLCD63_MASK                   0x40u
#define LCD_WF8B_BPGLCD63_SHIFT                  6
#define LCD_WF8B_BPGLCD63_WIDTH                  1
#define LCD_WF8B_BPGLCD63(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD63_SHIFT))&LCD_WF8B_BPGLCD63_MASK)
#define LCD_WF8B_BPGLCD15_MASK                   0x40u
#define LCD_WF8B_BPGLCD15_SHIFT                  6
#define LCD_WF8B_BPGLCD15_WIDTH                  1
#define LCD_WF8B_BPGLCD15(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD15_SHIFT))&LCD_WF8B_BPGLCD15_MASK)
#define LCD_WF8B_BPGLCD62_MASK                   0x40u
#define LCD_WF8B_BPGLCD62_SHIFT                  6
#define LCD_WF8B_BPGLCD62_WIDTH                  1
#define LCD_WF8B_BPGLCD62(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD62_SHIFT))&LCD_WF8B_BPGLCD62_MASK)
#define LCD_WF8B_BPGLCD54_MASK                   0x40u
#define LCD_WF8B_BPGLCD54_SHIFT                  6
#define LCD_WF8B_BPGLCD54_WIDTH                  1
#define LCD_WF8B_BPGLCD54(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD54_SHIFT))&LCD_WF8B_BPGLCD54_MASK)
#define LCD_WF8B_BPGLCD61_MASK                   0x40u
#define LCD_WF8B_BPGLCD61_SHIFT                  6
#define LCD_WF8B_BPGLCD61_WIDTH                  1
#define LCD_WF8B_BPGLCD61(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD61_SHIFT))&LCD_WF8B_BPGLCD61_MASK)
#define LCD_WF8B_BPGLCD60_MASK                   0x40u
#define LCD_WF8B_BPGLCD60_SHIFT                  6
#define LCD_WF8B_BPGLCD60_WIDTH                  1
#define LCD_WF8B_BPGLCD60(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD60_SHIFT))&LCD_WF8B_BPGLCD60_MASK)
#define LCD_WF8B_BPGLCD59_MASK                   0x40u
#define LCD_WF8B_BPGLCD59_SHIFT                  6
#define LCD_WF8B_BPGLCD59_WIDTH                  1
#define LCD_WF8B_BPGLCD59(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD59_SHIFT))&LCD_WF8B_BPGLCD59_MASK)
#define LCD_WF8B_BPGLCD53_MASK                   0x40u
#define LCD_WF8B_BPGLCD53_SHIFT                  6
#define LCD_WF8B_BPGLCD53_WIDTH                  1
#define LCD_WF8B_BPGLCD53(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD53_SHIFT))&LCD_WF8B_BPGLCD53_MASK)
#define LCD_WF8B_BPGLCD58_MASK                   0x40u
#define LCD_WF8B_BPGLCD58_SHIFT                  6
#define LCD_WF8B_BPGLCD58_WIDTH                  1
#define LCD_WF8B_BPGLCD58(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD58_SHIFT))&LCD_WF8B_BPGLCD58_MASK)
#define LCD_WF8B_BPGLCD0_MASK                    0x40u
#define LCD_WF8B_BPGLCD0_SHIFT                   6
#define LCD_WF8B_BPGLCD0_WIDTH                   1
#define LCD_WF8B_BPGLCD0(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD0_SHIFT))&LCD_WF8B_BPGLCD0_MASK)
#define LCD_WF8B_BPGLCD57_MASK                   0x40u
#define LCD_WF8B_BPGLCD57_SHIFT                  6
#define LCD_WF8B_BPGLCD57_WIDTH                  1
#define LCD_WF8B_BPGLCD57(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD57_SHIFT))&LCD_WF8B_BPGLCD57_MASK)
#define LCD_WF8B_BPGLCD52_MASK                   0x40u
#define LCD_WF8B_BPGLCD52_SHIFT                  6
#define LCD_WF8B_BPGLCD52_WIDTH                  1
#define LCD_WF8B_BPGLCD52(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD52_SHIFT))&LCD_WF8B_BPGLCD52_MASK)
#define LCD_WF8B_BPGLCD7_MASK                    0x40u
#define LCD_WF8B_BPGLCD7_SHIFT                   6
#define LCD_WF8B_BPGLCD7_WIDTH                   1
#define LCD_WF8B_BPGLCD7(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD7_SHIFT))&LCD_WF8B_BPGLCD7_MASK)
#define LCD_WF8B_BPGLCD56_MASK                   0x40u
#define LCD_WF8B_BPGLCD56_SHIFT                  6
#define LCD_WF8B_BPGLCD56_WIDTH                  1
#define LCD_WF8B_BPGLCD56(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD56_SHIFT))&LCD_WF8B_BPGLCD56_MASK)
#define LCD_WF8B_BPGLCD6_MASK                    0x40u
#define LCD_WF8B_BPGLCD6_SHIFT                   6
#define LCD_WF8B_BPGLCD6_WIDTH                   1
#define LCD_WF8B_BPGLCD6(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD6_SHIFT))&LCD_WF8B_BPGLCD6_MASK)
#define LCD_WF8B_BPGLCD51_MASK                   0x40u
#define LCD_WF8B_BPGLCD51_SHIFT                  6
#define LCD_WF8B_BPGLCD51_WIDTH                  1
#define LCD_WF8B_BPGLCD51(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD51_SHIFT))&LCD_WF8B_BPGLCD51_MASK)
#define LCD_WF8B_BPGLCD16_MASK                   0x40u
#define LCD_WF8B_BPGLCD16_SHIFT                  6
#define LCD_WF8B_BPGLCD16_WIDTH                  1
#define LCD_WF8B_BPGLCD16(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD16_SHIFT))&LCD_WF8B_BPGLCD16_MASK)
#define LCD_WF8B_BPGLCD1_MASK                    0x40u
#define LCD_WF8B_BPGLCD1_SHIFT                   6
#define LCD_WF8B_BPGLCD1_WIDTH                   1
#define LCD_WF8B_BPGLCD1(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD1_SHIFT))&LCD_WF8B_BPGLCD1_MASK)
#define LCD_WF8B_BPGLCD17_MASK                   0x40u
#define LCD_WF8B_BPGLCD17_SHIFT                  6
#define LCD_WF8B_BPGLCD17_WIDTH                  1
#define LCD_WF8B_BPGLCD17(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD17_SHIFT))&LCD_WF8B_BPGLCD17_MASK)
#define LCD_WF8B_BPGLCD50_MASK                   0x40u
#define LCD_WF8B_BPGLCD50_SHIFT                  6
#define LCD_WF8B_BPGLCD50_WIDTH                  1
#define LCD_WF8B_BPGLCD50(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD50_SHIFT))&LCD_WF8B_BPGLCD50_MASK)
